# Python for Data Analysts
**Inclass for Week 1**

## Training Objectives

- Introduction to the `pandas` library. 
- Introduction to `DataFrame`  
- Data Types
- Exploratory Data Analysis I
- Indexing and Subsetting

Kumpulan shortcut: **CTRL + SHIFT + P**

Tipe cell dalam notebook:
1. Markdown
2. Code

Mode cell dalam notebook:
1. Command mode (cell berwarna BIRU)
    - B: menambahkan cell baru di Bawah (Below)
    - A: menambahkan cell baru di Atas (Above)
    - DD: Delete cell
    - C: Copy cell
    - V: Paste cell
    - Y: Mengubah ke code cell
    - M: Mengubah ke markdown cell
    - Enter: Mengubah command mode menjadi edit mode


2. Edit mode (cell berwarna HIJAU)
    - Ctrl + Enter: eksekusi satu cell
    - Esc: Mengubah edit mode menjadi command mode

**START OF DAY 2**

# Variables and Keywords

**Variable** adalah sebuah nama yang dipakai untuk menunjukkan sebuah nilai. Tanda `=` dipakai untuk membuat variable baru. Proses ini sering disebut sebagai **assignment**.

In [9]:
##code here

penjumlahan = 1+1
print(penjumlahan)

pengurangan = 2-1
print(pengurangan)

2
1

Python adalah bahasa pemrograman yang **case-sensitive** sehingga penamaan variable menjadi hal yang perlu diperhatikan. Misal penulisan variable `activity` dengan awalan huruf `a` kecil berbeda dengan yang diawali dengan huruf `A` besar.

In [11]:
##code here
activity = "programming"
activity

'programming'

In [12]:
#perintah di bawah ini akan menghasilkan error ketika dijalankan

activity = Activity

NameError: name 'Activity' is not defined

Berikut beberapa anjuran dalam memberikan nama variable pada Python:
- Menggunakan kombinasi dari huruf kapital (A-Z), huruf nomina (a-z), angka (0-9).
- Special character `!, $ , &, dll` tidak dapat digunakan dalam penamaan variabel.
- Tidak boleh menggunakan angka di awal.
- Tidak boleh menggunakan keyword pada Python
- Bersifat case-sensitive sehingga penamaan variable `algoritma`, `ALGORITMA`, dan `Algoritma` adalah 3 variable yang berbeda

**Keywords** adalah kata kunci yang sudah ditetapkan oleh Python sebagai nama yang tidak bisa dipakai baik untuk penamaan fungsi, variabel, dan lainnya. Keyword ditulis dalam lower-case (huruf kecil semua) kecuali keyword `True`, `False`, dan `None`. Sejauh ini (Python 3.8) keyword yang ada pada Python adalah sebagai berikut:

In [15]:
#Cek daftar keyword
import keyword
keyword.kwlist

['False',
 'None',
 'True',
 'and',
 'as',
 'assert',
 'async',
 'await',
 'break',
 'class',
 'continue',
 'def',
 'del',
 'elif',
 'else',
 'except',
 'finally',
 'for',
 'from',
 'global',
 'if',
 'import',
 'in',
 'is',
 'lambda',
 'nonlocal',
 'not',
 'or',
 'pass',
 'raise',
 'return',
 'try',
 'while',
 'with',
 'yield']

Untuk membuktikan bahwa keyword tidak dapat digunakan sebagai nama variabel, mari kita coba untuk menyimpan nilai 1 pada variabel `True`.

In [16]:
##code here

True = 1

SyntaxError: cannot assign to True (<ipython-input-16-48724fd16113>, line 3)

In [18]:
# penamaan seperti ini tidak disarankan
true = 1
true

1

# Introduction to Pandas Library

## Working with DataFrame

`pandas` adalah library yang powerful sebagai tools analisis data dan struktur pada Python. Dengan `pandas`, mengolah data menjadi mudah karena disediakan salah satu objek bernama **DataFrame**. Dengan dataframe kita dapat membaca sebuah file, mengolah suatu data dengan menggunakan operasi seperti join, distinct, group by, agregasi, dan teknik lainnya.

> Lebih lengkapnya silahkan kunjungi [official documentation](https://pandas.pydata.org/)

Untuk menggunakan `pandas`, kita perlu import terlebih dahulu library dengan cara berikut ini:

In [20]:
##code here
import pandas
pandas.__version__

'1.2.1'

Kita bisa menggunakan teknik **aliasing** agar pengetikan nama library tidak terlalu panjang, yaitu dengan `as`.

In [1]:
##code here
import pandas as pd
pd.__version__

'1.2.1'

Semua method pada `pandas` dapat dipanggil dengan syntax seperti: `pandas.function_name()`. Langkah pertama yang akan kita lakukan adalah membaca data. Kita dapat menggunakan method `.read_csv()` untuk membaca sebuah file dengan format `.csv`.

In [33]:
##code here
rice = pd.read_csv("data_input/rice.csv")
rice

,Unnamed: 0,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
0,1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
1,2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
2,3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
3,4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
4,5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07
...,...,...,...,...,...,...,...,...,...,...,...
11995,11996,5760491,17555486,12/15/2017 21:06,Rice,Rice,supermarket,128000.0,0,1,2017-12
11996,11997,5598782,16999147,12/2/2017 14:12,Rice,Rice,minimarket,64000.0,0,1,2017-12
11997,11998,5735850,17434503,12/13/2017 19:17,Rice,Rice,supermarket,59990.0,3000,1,2017-12
11998,11999,5678748,17317935,12/8/2017 22:04,Rice,Rice,minimarket,59500.0,3000,1,2017-12
11999,12000,5702411,17341559,12/10/2017 17:04,Rice,Rice,minimarket,59500.0,3000,1,2017-12

In [28]:
type(rice)

pandas.core.frame.DataFrame

In [31]:
rec = rice['receipt_id']
type(rec)

pandas.core.series.Series

- Tanda `()` digunakan untuk fungsi/method atau bisa juga digunakan untuk sturktur data tuple
- Tanda `[]` digunakan untuk kebutuhan slicing/indexing atau bisa juga digunakan untuk sturktur data list
- Tanda `{}` biasanya digunakan pada dictionary

Kita coba set kolom pertama `Unnamed: 0` menjadi index dari dataframe, dengan cara menambahkan **parameter** `index_col=0`.

In [2]:
##code here
rice = pd.read_csv("data_input/rice.csv", index_col= 0)
rice

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07
...,...,...,...,...,...,...,...,...,...,...
11996,5760491,17555486,12/15/2017 21:06,Rice,Rice,supermarket,128000.0,0,1,2017-12
11997,5598782,16999147,12/2/2017 14:12,Rice,Rice,minimarket,64000.0,0,1,2017-12
11998,5735850,17434503,12/13/2017 19:17,Rice,Rice,supermarket,59990.0,3000,1,2017-12
11999,5678748,17317935,12/8/2017 22:04,Rice,Rice,minimarket,59500.0,3000,1,2017-12
12000,5702411,17341559,12/10/2017 17:04,Rice,Rice,minimarket,59500.0,3000,1,2017-12

Intuisi dari parameter `index_col` pada `read_csv()` adalah menjadikan kolom pada Dataframe sebagai index pada baris. Berikut beberapa nilai yang dapat ditampung oleh parameter `index_col`.
- (0, 1, 2, dst) : Menunjukkan index kolom yang akan dijadikan sebagai index baris.
- `'nama_kolom'` : Selain menggunakan nilai index nya, kita juga dapat langsung mengetikkan nama kolomnya.
- `False` : Menggunakan index yang disediakan oleh `pandas`.

Selain menggunakan parameter indexnya, kita juga dapat mendefinisikan nama kolomnya langsung seperti contoh di bawah ini :

In [60]:
##code here
rice = pd.read_csv("data_input/rice.csv",  skiprows=1)
rice

,1,9622257,32369294,7/22/2018 21:19,Rice,Rice.1,supermarket,128000,0,1.1,2018-07
0,2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
1,3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
2,4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
3,5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07
4,6,9504155,32030785,7/17/2018 18:05,Rice,Rice,minimarket,63500.0,0,1,2018-07
...,...,...,...,...,...,...,...,...,...,...,...
11994,11996,5760491,17555486,12/15/2017 21:06,Rice,Rice,supermarket,128000.0,0,1,2017-12
11995,11997,5598782,16999147,12/2/2017 14:12,Rice,Rice,minimarket,64000.0,0,1,2017-12
11996,11998,5735850,17434503,12/13/2017 19:17,Rice,Rice,supermarket,59990.0,3000,1,2017-12
11997,11999,5678748,17317935,12/8/2017 22:04,Rice,Rice,minimarket,59500.0,3000,1,2017-12
11998,12000,5702411,17341559,12/10/2017 17:04,Rice,Rice,minimarket,59500.0,3000,1,2017-12

**Additional Information:**

1. Python menggunakan sistem **zero based indexing** yang berarti, index pada python dimulai dari angka 0.
2. Terdapat beberapa parameter dalam method `.read_csv()`, dokumentasi selengkapnya ada [di sini](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html)

### Knowledge Check: Error

Mengacu pada konsep penulisan **python keywords** diatas, manakah diantara ke-4 kode program ini yang **tidak** menghasilkan error ketika dijalankan?

- [ ] `pd.read_csv("data_input/rice.csv", index_col=false)`
- [ ] `Import pandas as pd`
- [ ] `print(100-2)`
- [ ] `None = 2`

In [51]:
#No 1 Mbak Putu
pd.read_csv("data_input/rice.csv", index_col=false) # error karna harusnya False bukan false

NameError: name 'false' is not defined

In [52]:
#No 2 Mas Sayid
Import pandas as pd # yang membuat error penulisan import dengan I besar

SyntaxError: invalid syntax (<ipython-input-52-3adec25d7206>, line 2)

In [50]:
#No 3 Mbak Laras
print(100-2)

98

In [53]:
#No 4 Mas Stefanus
None = 2 # error keyword None tidak boleh digunakan sebagai nama variable

SyntaxError: cannot assign to None (<ipython-input-53-e62f065aabbd>, line 2)

### Dive Deeper

1. Baca kembali data `rice` menggunakan perintah `pd.read_csv()`, kemudian simpan kedalam variable baru bernama `rice_new`. Dengan menggunakan parameter `index_col`, jadikan kolom `receipt_id` sebagai index baris nya!
2. `pandas.DataFrame.head(n)` dapat digunakan untuk menampilkan sebagian data teratas, dengan asumsi bahwa nilai `n` adalah jumlah baris yang ingin kita tampilkan. Silahkan set `head()` dengan nilai `n=8` pada data `rice_new`, kemudian lihat apa yang terjadi! 
3. Lawan dari `head()` adalah `tail()`. Method `tail()` akan menampilkan data dari urutan paling bawah. Silahkan set `tail()` dengan nilai `n=4`, kemudian lihat apa yang terjadi!

In [54]:
# code here
# Mas Calvin
rice_new = pd.read_csv("data_input/rice.csv", index_col = "receipt_id")
rice_new

,Unnamed: 0,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
receipt_id,,,,,,,,,,
9622257,1,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
9446359,2,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
9470290,3,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
9643416,4,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
9692093,5,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07
...,...,...,...,...,...,...,...,...,...,...
5760491,11996,17555486,12/15/2017 21:06,Rice,Rice,supermarket,128000.0,0,1,2017-12
5598782,11997,16999147,12/2/2017 14:12,Rice,Rice,minimarket,64000.0,0,1,2017-12
5735850,11998,17434503,12/13/2017 19:17,Rice,Rice,supermarket,59990.0,3000,1,2017-12
5678748,11999,17317935,12/8/2017 22:04,Rice,Rice,minimarket,59500.0,3000,1,2017-12
5702411,12000,17341559,12/10/2017 17:04,Rice,Rice,minimarket,59500.0,3000,1,2017-12

In [55]:
# No 2 Mbak Ika

rice_new.head(n=8)

,Unnamed: 0,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
receipt_id,,,,,,,,,,
9622257,1,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
9446359,2,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
9470290,3,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
9643416,4,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
9692093,5,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07
9504155,6,32030785,7/17/2018 18:05,Rice,Rice,minimarket,63500.0,0,1,2018-07
9822589,7,32935097,7/29/2018 18:18,Rice,Rice,supermarket,66500.0,0,1,2018-07
9706953,8,32593606,7/25/2018 12:48,Rice,Rice,minimarket,62500.0,0,1,2018-07

In [56]:
# No 3 Mas Bayu
rice_new.tail(4)

,Unnamed: 0,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
receipt_id,,,,,,,,,,
5598782,11997,16999147,12/2/2017 14:12,Rice,Rice,minimarket,64000.0,0,1,2017-12
5735850,11998,17434503,12/13/2017 19:17,Rice,Rice,supermarket,59990.0,3000,1,2017-12
5678748,11999,17317935,12/8/2017 22:04,Rice,Rice,minimarket,59500.0,3000,1,2017-12
5702411,12000,17341559,12/10/2017 17:04,Rice,Rice,minimarket,59500.0,3000,1,2017-12

In [57]:
rice.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07

In [58]:
rice.tail()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
11996,5760491,17555486,12/15/2017 21:06,Rice,Rice,supermarket,128000.0,0,1,2017-12
11997,5598782,16999147,12/2/2017 14:12,Rice,Rice,minimarket,64000.0,0,1,2017-12
11998,5735850,17434503,12/13/2017 19:17,Rice,Rice,supermarket,59990.0,3000,1,2017-12
11999,5678748,17317935,12/8/2017 22:04,Rice,Rice,minimarket,59500.0,3000,1,2017-12
12000,5702411,17341559,12/10/2017 17:04,Rice,Rice,minimarket,59500.0,3000,1,2017-12

## Tipe Data (Data Types)

Dataframe terdiri dari beberapa **Series** (mengacu pada satu kolom). Dalam satu series harus memiliki satu tipe data yang sama. `pandas`akan mencoba untuk infer tipe data dari masing-masing Series, tapi tidak selalu benar.

Cara cek tipe data: `dtypes` atau `.info()` untuk lebih lengkapnya

**_Soal 1:_** Dengan menggunakan data rice, silahkan cek tipe data menggunakan `dtypes`!

In [61]:
##code here
rice = pd.read_csv('data_input/rice.csv', index_col=0)

Object : 
- Method : head(7), tail(n=?)
- Atribut : dtypes

'1000'

In [64]:
rice.dtypes

receipt_id            int64
receipts_item_id      int64
purchase_time        object
category             object
sub_category         object
format               object
unit_price          float64
discount              int64
quantity              int64
yearmonth            object
dtype: object

**Notes:**

- `int64`: integer (bilangan bulat, tanpa koma)
- `float64`: bilangan desimal (berkoma)
- `object`: text (string)

In [65]:
# code here (inspect data types with info())
rice.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12000 entries, 1 to 12000
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   receipt_id        12000 non-null  int64
 1   receipts_item_id  12000 non-null  int64
 2   purchase_time     12000 non-null  object
 3   category          12000 non-null  object
 4   sub_category      12000 non-null  object
 5   format            12000 non-null  object
 6   unit_price        12000 non-null  float64
 7   discount          12000 non-null  int64
 8   quantity          12000 non-null  int64
 9   yearmonth         12000 non-null  object
dtypes: float64(1), int64(4), object(5)
memory usage: 1.0+ MB

### Knowledge check: `.dtypes` and pandas attributes
Salin kode program di bawah ini, kemudian jalankan. 
```
x = [2019, 4, 'data science']
x.dtypes

```
Apa yang terjadi?

In [66]:
##code here
x = [2019, 4, 'data science']
x.dtypes

AttributeError: 'list' object has no attribute 'dtypes'

Ketikkan perintah `type(x)`, maka apa perbedaannya dengan sebelumnya?

In [67]:
##code here
type(x)

list

Kesimpulan: Atribut `dtypes` hanya dimiliki oleh objek dataframe sehingga `dtypes` tidak bisa diaplikasikan untuk list.

Perhatikan dataframe baru di bawah ini untuk contoh lain dari tipe data pada `pandas`!

In [68]:
employees = pd.DataFrame({
    'name': ['Anita', 'Brian'],
    'age': [34, 29],
    'joined': [pd.Timestamp('20190410'), pd.Timestamp('20171128')],
    'degree': [True, False],
    'hourlyrate': [35.5, 29],
    'division': ['HR', 'Product']
})
employees.dtypes

name                  object
age                    int64
joined        datetime64[ns]
degree                  bool
hourlyrate           float64
division              object
dtype: object

In [31]:
employees

    name  age     joined  degree  hourlyrate division
0  Anita   34 2019-04-10    True        35.5       HR
1  Brian   29 2017-11-28   False        29.0  Product

- `name` [`object`]: store text values
- `age` [`int`]: integer values
- `joined` [`datetime`]: date and time values
- `degree` [`bool`]: True/False values
- `hourlyrate` [`float`]: floating point values
- `division` [`object`]: store text values

### Categorical and Numerical Variables

Tipe data categorical adalah tipe data yang memiliki karakteristik dimana nilainya dapat berulang pada sebuah Series di dataframe. 

Dua alasan mengapa kita perlu menggunakan tipe data categorical:

1. Dari sisi "business perspective", hal ini dapat menginformasikan dan memandu seorang Analyst pada pertanyaan seperti metode statistik atau tipe plot mana yang digunakan untuk mengolah data.

2. Dari sisi teknikal, ketika kita bekerja dengan tipe data categorical pada pandas, hal ini akan jauh menghemat memori dan menambah kecepatan komputasional.

Dikutip dari official documentation:

> Categoricals are a pandas data type corresponding to categorical variables in statistics. A categorical variable takes on a limited, and usually fixed, number of possible values (categories; levels in R). Examples are gender, social class, blood type, country affiliation or rating via Likert scales.

Untuk mengubah tipe data ke categorical pada pandas, Anda dapat melakukannya dengan method `astype()` berikut:

**Formula** 
```
df['column_name'] = df['column_name'].astype('new_data_types')
```

**Contoh**
```
employees['marital_status'] = employees['marital_status'].astype('category')
```

In [69]:
employees

    name  age     joined  degree  hourlyrate division
0  Anita   34 2019-04-10    True        35.5       HR
1  Brian   29 2017-11-28   False        29.0  Product

In [70]:
employees.dtypes

name                  object
age                    int64
joined        datetime64[ns]
degree                  bool
hourlyrate           float64
division              object
dtype: object

**_Soal 2:_** Perhatikan dataframe `employees`. Adakah kolom yang tipe datanya belum tersimpan dengan benar? Ubahlah ke tipe data yang tepat dengan menggunakan method `astype()`!

In [71]:
##code here
employees['division'] = employees['division'].astype('category')

In [72]:
employees.dtypes

name                  object
age                    int64
joined        datetime64[ns]
degree                  bool
hourlyrate           float64
division            category
dtype: object

In [73]:
employees['name'].astype('category')

0    Anita
1    Brian
Name: name, dtype: category
Categories (2, object): ['Anita', 'Brian']

In [74]:
employees.dtypes

name                  object
age                    int64
joined        datetime64[ns]
degree                  bool
hourlyrate           float64
division            category
dtype: object

**Notes**

- `type()` adalah sebuah **fungsi** pada python. Fungsi `type()` digunakan untuk mengecek struktur/tipe objek atau variabel dimana penggunaannya tidak didahului dengan pemanggilan nama objek.
- `dtypes` adalah **atribut** yang dimiliki oleh objek dataframe. `dtypes` digunakan untuk melihat tipe data dari masing-masing kolom yang ada pada dataframe. Penggunaan `dtypes` diawali dengan memanggil nama objeknya (karena dia adalah atribut sebuah objek)

### Rangkuman Data Types

Fokus pada kolom Pandas dtype dan usage-nya:

| Pandas dtype  | Python type  | NumPy type                                                     | Usage                                        |
|---------------|--------------|----------------------------------------------------------------|----------------------------------------------|
| object        | str or mixed | string_, unicode_, mixed types                                 | Text or mixed numeric and non-numeric values |
| int64         | int          | int_, int8, int16, int32, int64, uint8, uint16, uint32, uint64 | Integer numbers                              |
| float64       | float        | float_, float16, float32, float64                              | Floating point numbers                       |
| bool          | bool         | bool_                                                          | True/False values                            |
| datetime64    | NA           | datetime64[ns]                                                 | Date and time values                         |
| timedelta[ns] | NA           | NA                                                             | Differences between two datetimes            |
| category      | NA           | NA                                                             | Finite list of text values                   |

Referensi: [Overview of Pandas Data Types](https://pbpython.com/pandas_dtypes.html)

## Exploratory Data Analysis I

Exploratory Data Analysis (**EDA**) mengacu pada proses melakukan investigasi awal pada data, seringkali dengan tujuan untuk lebih mengenal dengan karakteristik data tertentu. EDA dilakukan dengan bantuan ringkasan statistik dan teknik grafis sederhana untuk melihat struktur data yang kita miliki.

Beberapa tools sederhana pada `pandas` yang dapat digunakan untuk melakukan EDA adalah sebagai berikut:
- `.head()` and `.tail()`
- `.describe()`
- `.shape` and `.size`
- `.axes`
- `.dtypes`

### `head()` and `tail()`

- `head(n)` digunakan untuk inspeksi `n` data teratas dari sebuah dataframe.
- `tail(n)` digunakan untuk inspeksi `n` data terbawah dari sebuah dataframe.

In [75]:
##code here

rice.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07

In [76]:
##code here
rice.tail()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
11996,5760491,17555486,12/15/2017 21:06,Rice,Rice,supermarket,128000.0,0,1,2017-12
11997,5598782,16999147,12/2/2017 14:12,Rice,Rice,minimarket,64000.0,0,1,2017-12
11998,5735850,17434503,12/13/2017 19:17,Rice,Rice,supermarket,59990.0,3000,1,2017-12
11999,5678748,17317935,12/8/2017 22:04,Rice,Rice,minimarket,59500.0,3000,1,2017-12
12000,5702411,17341559,12/10/2017 17:04,Rice,Rice,minimarket,59500.0,3000,1,2017-12

EDA:
- MElihat struktur data
- MElihat secara statistik dari data-data yang ada
- MElihat statistika data secara visual

### `describe()`

Method `describe()` menampilkan 8 ringkasan statistika deskriptif. Secara default menampilkan ringkasan untuk kolom numerik. 

Ringkasan statistika yang dimaksud adalah sebagai berikut:
- Count: banyaknya baris pada dataframe
- Mean: rata-rata nilai
- Standard Deviation: jarak rata-rata antara data ke mean (titik pusat data)
- Minimum Value: nilai terkecil dari keseluruhan data
- 25th Percentile (Q1)
- 50th Percentile (Q2/Median)
- 75th Percentile (Q3)
- Maximum Value: nilai terbesar dari keseluruhan data

In [77]:
rice.describe()

,receipt_id,receipts_item_id,unit_price,discount,quantity
count,1.200000e+04,1.200000e+04,12000.000000,12000.000000,12000.000000
mean,7.650135e+06,2.457950e+07,70013.146313,835.305750,1.332917
std,1.873838e+06,7.171105e+06,29905.391437,6207.475704,0.980304
min,3.173994e+06,9.282023e+06,9395.000000,-4100.000000,1.000000
25%,5.983209e+06,1.820694e+07,61900.000000,0.000000,1.000000
50%,7.443618e+06,2.234337e+07,63500.000000,0.000000,1.000000
75%,9.149786e+06,3.108379e+07,66000.000000,0.000000,1.000000
max,1.146321e+07,3.842939e+07,219400.000000,320000.000000,19.000000

Kode program untuk mengobah notasi scientific ke dalam bentuk float numeric dengan 3 angka di belakang koma :

In [78]:
pd.set_option('display.float_format', lambda x: '%.3f' % x)

In [79]:
rice.describe()

        receipt_id  receipts_item_id  unit_price   discount  quantity
count    12000.000         12000.000   12000.000  12000.000 12000.000
mean   7650135.157      24579495.813   70013.146    835.306     1.333
std    1873838.101       7171105.455   29905.391   6207.476     0.980
min    3173994.000       9282023.000    9395.000  -4100.000     1.000
25%    5983209.250      18206938.000   61900.000      0.000     1.000
50%    7443618.000      22343373.500   63500.000      0.000     1.000
75%    9149786.000      31083788.000   66000.000      0.000     1.000
max   11463208.000      38429394.000  219400.000 320000.000    19.000

Ringkasan seperti count, mean, std, min, dan max memiliki method nya masing-masing:

In [92]:
rice.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.000,0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.000,0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.000,0,3,2018-07
4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.000,0,1,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.000,0,1,2018-07

In [95]:
#count
rice['unit_price'].count()

12000

In [82]:
#mean
rice['unit_price'].mean()

70013.14631275

In [83]:
#std
rice['unit_price'].std()

29905.39143678175

In [84]:
#min
rice['unit_price'].min()

9395.0

In [85]:
#max
rice['unit_price'].max()

219400.0

Untuk ringkasan seperti Q1, Q2, Q3 kita dapat menggunakan method `quantile()`. Secara default adalah nilai Q2.

In [86]:
#untuk nilai Q1 atau data ke 25%
rice['unit_price'].quantile(0.25)

61900.0

In [87]:
#untuk nilai Q1 atau data ke 50%
rice['unit_price'].quantile()

63500.0

In [90]:
#untuk nilai Q1 atau data ke 75%
rice['unit_price'].quantile(0.75)

66000.0

**Additional Information**

Kita bisa menambahkan parameter `include` ataupun `exclude` pada `describe()` untuk melihat statistika deskriptif dari variable non-numeric:

In [98]:
rice.dtypes

receipt_id            int64
receipts_item_id      int64
purchase_time        object
category             object
sub_category         object
format               object
unit_price          float64
discount              int64
quantity              int64
yearmonth            object
dtype: object

In [3]:
##code here
rice.describe(exclude='number') #menampilkan statistik desriptif untuk kolom non-numeric

         purchase_time category sub_category      format yearmonth
count            12000    12000        12000       12000     12000
unique           11609        1            1           3        12
top     6/14/2018 0:00     Rice         Rice  minimarket   2018-02
freq                 4    12000        12000        7088      1000

- unique: nilai unik di setiap kolom atau variabel
- top: nilai terbanyak (modus)
- freq: banyaknya kemunculan modus

Misal kita tertarik melihat unique pada kolom `format`:

In [99]:
#code here
rice['format'].unique()

array(['supermarket', 'minimarket', 'hypermarket'], dtype=object)

In [100]:
rice['format'].nunique()

3

**NOTE:** : Kita tidak dapat menggunakan `top` atau `freq` untuk melakukan pengecekan manual seperti halnya `unique`. Hal ini dikarenakan `top` dan `freq` bukanlah sebuah method ataupun atribut pada `pandas`, sedangkan `unique` adalah sebuah method dari `pandas`.

### Summary Day 2
- variabel : nama untuk menyimpan sebuah nilai
- keyword : kata kunci yang ditetapkan oleh python. 

- Pandas
cara import pandas bisa menggunkaan syntax : import pandas as pd
- Dataframe : Data yang terdiri dari kolom dan baris/spesial list.
- Series : unit terkecil dari sususnan DF (1 kolom) 
- Membaca file csv : pd.read_csv()
dimana kita bisa menambahkan parameter index_col untuk setting index row

- Tipe data di pandas:
    - object : menyimpan text atau string
    - int64 : menyimpan angka dikrit
    - float64 : menyimpan angka/bilangan desimal
    - bool : menyimpan bilang logika (True/False)
    - datetime64 : menyimpan informasi tanggal dan waktu
    - category : menyimpan nilai(string) yang sifatnya berulan/fixed-
- Cek tipe data : dtypes
- Cek struktur data : type()
- Mengubah tipe data : astype()

EDA : inspeksi /mengeksplor data untuk kebutuhan penarikan insight/informasi baru
- head() : inspeksi 5 data teratas secara default
- tail() : inspeksi 5 data terbawah secara default
- describe() : menampilkan 8 ringkasan statistik dari kolom-kolom yang tipe datanya dalah numerik
- Parameter include/exclude yang ada di describe() bisa ditambahkan untuk memilih kolom-kolom tertentu
- unique() : melihat nilai unik pada sebuah kolom

===================================== END OF DAY 2 =============================================

**_Soal 3:_** Melihat statistika deskriptif untuk kolom bertipe data **selain** 'object' menggunakan `exclude`

In [4]:
#code here
rice.describe()
rice.describe(exclude='object')

,receipt_id,receipts_item_id,unit_price,discount,quantity
count,1.200000e+04,1.200000e+04,12000.000000,12000.000000,12000.000000
mean,7.650135e+06,2.457950e+07,70013.146313,835.305750,1.332917
std,1.873838e+06,7.171105e+06,29905.391437,6207.475704,0.980304
min,3.173994e+06,9.282023e+06,9395.000000,-4100.000000,1.000000
25%,5.983209e+06,1.820694e+07,61900.000000,0.000000,1.000000
50%,7.443618e+06,2.234337e+07,63500.000000,0.000000,1.000000
75%,9.149786e+06,3.108379e+07,66000.000000,0.000000,1.000000
max,1.146321e+07,3.842939e+07,219400.000000,320000.000000,19.000000

**_Soal 4:_** Melihat statistika deskriptif untuk kolom bertipe data **numeric** menggunakan `include`

In [5]:
##code here
rice.describe(exclude='number')

,receipt_id,receipts_item_id,unit_price,discount,quantity
count,1.200000e+04,1.200000e+04,12000.000000,12000.000000,12000.000000
mean,7.650135e+06,2.457950e+07,70013.146313,835.305750,1.332917
std,1.873838e+06,7.171105e+06,29905.391437,6207.475704,0.980304
min,3.173994e+06,9.282023e+06,9395.000000,-4100.000000,1.000000
25%,5.983209e+06,1.820694e+07,61900.000000,0.000000,1.000000
50%,7.443618e+06,2.234337e+07,63500.000000,0.000000,1.000000
75%,9.149786e+06,3.108379e+07,66000.000000,0.000000,1.000000
max,1.146321e+07,3.842939e+07,219400.000000,320000.000000,19.000000

**_Soal 5:_** Bagaimana menampilkan statistika deskriptif hanya kolom yang bertipe data **int64** dan **object** saja?

In [6]:
##code here
rice.describe(include=['int64','object'])

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,discount,quantity,yearmonth
count,1.200000e+04,1.200000e+04,12000,12000,12000,12000,12000.000000,12000.000000,12000
unique,NaN,NaN,11609,1,1,3,NaN,NaN,12
top,NaN,NaN,6/14/2018 0:00,Rice,Rice,minimarket,NaN,NaN,2018-02
freq,NaN,NaN,4,12000,12000,7088,NaN,NaN,1000
mean,7.650135e+06,2.457950e+07,NaN,NaN,NaN,NaN,835.305750,1.332917,NaN
std,1.873838e+06,7.171105e+06,NaN,NaN,NaN,NaN,6207.475704,0.980304,NaN
min,3.173994e+06,9.282023e+06,NaN,NaN,NaN,NaN,-4100.000000,1.000000,NaN
25%,5.983209e+06,1.820694e+07,NaN,NaN,NaN,NaN,0.000000,1.000000,NaN
50%,7.443618e+06,2.234337e+07,NaN,NaN,NaN,NaN,0.000000,1.000000,NaN
75%,9.149786e+06,3.108379e+07,NaN,NaN,NaN,NaN,0.000000,1.000000,NaN
max,1.146321e+07,3.842939e+07,NaN,NaN,NaN,NaN,320000.000000,19.000000,NaN

### `shape` dan `size`

`shape` dan `size` adalah atribut dari sebuah dataframe yang memberikan informasi terkait dimensi data dan ukuran data

In [7]:
##code here
rice.shape

(12000, 10)

In [9]:
rice.shape[0]

12000

In [10]:
rice.shape[1]

10

Angka pertama menunjukkan banyaknya row/observasi, angka kedua menunjukkan banyaknya kolom.

In [11]:
##code here
rice.size

120000

`size` = banyaknya row dikali banyaknya kolom.

### `axes`

`axes` adalah atribut dataframe yang memberikan informasi terkait index dataframe (baik index kolom maupun index baris)

In [13]:
rice.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07

In [12]:
##code here
rice.axes

[Int64Index([    1,     2,     3,     4,     5,     6,     7,     8,     9,
                10,
             ...
             11991, 11992, 11993, 11994, 11995, 11996, 11997, 11998, 11999,
             12000],
            dtype='int64', length=12000),
 Index(['receipt_id', 'receipts_item_id', 'purchase_time', 'category',
        'sub_category', 'format', 'unit_price', 'discount', 'quantity',
        'yearmonth'],
       dtype='object')]

In [14]:
rice.axes[0]

Int64Index([    1,     2,     3,     4,     5,     6,     7,     8,     9,
               10,
            ...
            11991, 11992, 11993, 11994, 11995, 11996, 11997, 11998, 11999,
            12000],
           dtype='int64', length=12000)

In [15]:
rice.axes[1]

Index(['receipt_id', 'receipts_item_id', 'purchase_time', 'category',
       'sub_category', 'format', 'unit_price', 'discount', 'quantity',
       'yearmonth'],
      dtype='object')

In [ ]:
# df.method_name(axis=0)

### `dtypes`

Atribut `dtypes` digunakan untuk melakukan inspeksi tipe data.

In [16]:
##code here

rice.dtypes

receipt_id            int64
receipts_item_id      int64
purchase_time        object
category             object
sub_category         object
format               object
unit_price          float64
discount              int64
quantity              int64
yearmonth            object
dtype: object

Kolom yang perlu dibenahi tipe datanya:
- purchase_time : datetime64
- category : category
- sub_category : category
- format : category
- receipt_id : object
- receipts_item_id : object

**_Soal 6:_** Kolom mana yang tipe datanya belum sesuai? Silahkan ubah dengan method `.astype()`!

In [19]:
##code here
# mbak laras, mas bayu, mas stefanus, mas calvin

rice['receipt_id'] = rice['receipt_id'].astype('object')
rice['receipts_item_id'] = rice['receipts_item_id'].astype('object')
rice['purchase_time'] = rice['purchase_time'].astype('datetime64')
rice['category'] = rice['category'].astype('category')
rice['format'] = rice['format'].astype('category')
rice['sub_category'] = rice['sub_category'].astype('category')

In [20]:
rice.dtypes

receipt_id                  object
receipts_item_id            object
purchase_time       datetime64[ns]
category                  category
sub_category              category
format                    category
unit_price                 float64
discount                     int64
quantity                     int64
yearmonth                   object
dtype: object

In [ ]:
# Alternatif lain mengubah tipe data
# rice[['receipt_id','receipts_item_id']] = rice[['receipt_id','receipt_item_id']].astype('object')
# rice[['format','category', 'sub_category']] = rice[['format','category', 'sub_category']].astype('object')

### Knowledge Check: Data types

Misalkan saja kita memiliki sebuah DataFrame dengan nama `inventory`.

1. Ketika menjalankan perintah `inventory.dtypes`, maka pandas akan menampilkan tipe data pada setiap kolom (series). Manakah kolom dibawah ini yang mungkin memiliki tipe data yang salah?
 - [ ] `units_instock`: int64
 - [ ] `discount_price`: float64
 - [ ] `item_name`: object
 - [x] `units_sold`: object
 
 
2. Kita ingin mengetahui jumlah kolom yang terdapat pada `inventory` DataFrame, manakah dibawah ini perintah yang tepat untuk menampilkan jumlah kolom `inventory`? Pilih beberapa kode program yang mungkin!
 - [x] `print(len(inventory.columns))`
 - [x] `print(inventory.shape[1])`
 - [ ] `print(len(rice.axes[1]))`

In [21]:
inventory = pd.DataFrame({
    'units_instock': [50, 40, 30],
    'discount_price': [15, 5, 7],
    'item_name': ['bawang', 'garam', 'gula'],
    'unit_sold': ['123', '456', '789']
})
inventory.dtypes

units_instock      int64
discount_price     int64
item_name         object
unit_sold         object
dtype: object

In [22]:
##code here
# No 1 Mbak Ani

inventory['unit_sold'] = inventory['unit_sold'].astype('int64')
inventory.dtypes

units_instock      int64
discount_price     int64
item_name         object
unit_sold          int64
dtype: object

In [23]:
# No 2 Mas Syayid
print(inventory.shape[1])

4

In [26]:
# No 2 Mbak Rinni
print(len(inventory.columns))
# print(len(inventory.index))

4

In [29]:
# code ketiga juga bisa digunakan, akan tetapi karena object yang dipanggil 
# adalah rice maka hasilnya tidak sesuai dengan jumlah kolom yang ada di dataframe inventory
print(len(rice.axes[1]))

10

In [30]:
inventory

   units_instock  discount_price item_name  unit_sold
0             50              15    bawang        123
1             40               5     garam        456
2             30               7      gula        789

## Indexing and Subsetting with Pandas

Indexing digunakan untuk memilih dan mengambil sebagian data yang hanya diperlukan dalam proses analisa data yang sedang dikerjakan. Contohnya:
- Compare sales pada tahun 2018 vs 2019
- Identifikasi peluang penjualan pada segment pasar (ex : Wholesale vs Retail)
- Melihat quarter terbaik untuk setiap tahun yang dapat digunakan untuk tujuan promosi
- dan sebagainya

Untuk melakukan indexing dan subsetting (slicing data) pada `pandas`, kita dapat menggunakan cara sebagai berikut:
- `head()` and `tail()`  
- `select_dtypes()`  
- Using `.drop()` 
- The `[]` operator
- `.loc`  
- `.iloc`
- Conditional subsetting

### `select_dtypes()`

Method `select_dtypes()` digunakan untuk memilih kolom sesuai dengan tipe datanya. Ada 2 parameter yang dapat digunakan di dalam method `select_dtypes()` yaitu parameter `include` dan `exclude` (seperti pada `describe()`.

Misal:
- parameter `include = 'category'` artinya kita memilih semua kolom dengan tipe data 'category'
- sebaliknya, ketika menggunakan parameter `exclude = 'category'` maka kolom-kolom dengan tipe data selain 'category' akan ditampilkan.

In [31]:
rice.dtypes

receipt_id                  object
receipts_item_id            object
purchase_time       datetime64[ns]
category                  category
sub_category              category
format                    category
unit_price                 float64
discount                     int64
quantity                     int64
yearmonth                   object
dtype: object

In [34]:
#Menampilkan data dengan tipe data category saja
rice.select_dtypes(include='category')
# rice.select_dtypes(include='category').describe() # proses chining /menggabungkan beberapa method

      category sub_category       format
1         Rice         Rice  supermarket
2         Rice         Rice   minimarket
3         Rice         Rice  supermarket
4         Rice         Rice   minimarket
5         Rice         Rice  supermarket
...        ...          ...          ...
11996     Rice         Rice  supermarket
11997     Rice         Rice   minimarket
11998     Rice         Rice  supermarket
11999     Rice         Rice   minimarket
12000     Rice         Rice   minimarket

[12000 rows x 3 columns]

**_Soal 7:_** Bagaimana cara Anda untuk menyeleksi kolom dengan tipe data `int64` dan `float64` untuk ditampilkan?

In [35]:
#code here
# Mbak ika
rice.select_dtypes(include=['int64','float64'])

# rice.select_dtypes(include='number')

       unit_price  discount  quantity
1        128000.0         0         1
2        102750.0         0         1
3         64000.0         0         3
4         65000.0         0         1
5        124500.0         0         1
...           ...       ...       ...
11996    128000.0         0         1
11997     64000.0         0         1
11998     59990.0      3000         1
11999     59500.0      3000         1
12000     59500.0      3000         1

[12000 rows x 3 columns]

### `drop()`

Method `drop()` digunakan untuk membuang baris atau kolom yang tidak ingin digunakan untuk tujuan analisis. Secara default method ini akan menghapus baris

**_Soal 8:_** Hapus baris pertama pada DataFrame!

In [38]:
#code here
rice.drop(index=1)

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
2,9446359,31885876,2018-07-15 16:17:00,Rice,Rice,minimarket,102750.0,0,1,2018-07
3,9470290,31930241,2018-07-15 12:12:00,Rice,Rice,supermarket,64000.0,0,3,2018-07
4,9643416,32418582,2018-07-24 08:27:00,Rice,Rice,minimarket,65000.0,0,1,2018-07
5,9692093,32561236,2018-07-26 11:28:00,Rice,Rice,supermarket,124500.0,0,1,2018-07
6,9504155,32030785,2018-07-17 18:05:00,Rice,Rice,minimarket,63500.0,0,1,2018-07
...,...,...,...,...,...,...,...,...,...,...
11996,5760491,17555486,2017-12-15 21:06:00,Rice,Rice,supermarket,128000.0,0,1,2017-12
11997,5598782,16999147,2017-12-02 14:12:00,Rice,Rice,minimarket,64000.0,0,1,2017-12
11998,5735850,17434503,2017-12-13 19:17:00,Rice,Rice,supermarket,59990.0,3000,1,2017-12
11999,5678748,17317935,2017-12-08 22:04:00,Rice,Rice,minimarket,59500.0,3000,1,2017-12
12000,5702411,17341559,2017-12-10 17:04:00,Rice,Rice,minimarket,59500.0,3000,1,2017-12

**_Soal 9:_** Hapus baris ke-2 dan ke-3 pada data!

In [39]:
#code here
rice.drop(index=[2,3])

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,2018-07-22 21:19:00,Rice,Rice,supermarket,128000.0,0,1,2018-07
4,9643416,32418582,2018-07-24 08:27:00,Rice,Rice,minimarket,65000.0,0,1,2018-07
5,9692093,32561236,2018-07-26 11:28:00,Rice,Rice,supermarket,124500.0,0,1,2018-07
6,9504155,32030785,2018-07-17 18:05:00,Rice,Rice,minimarket,63500.0,0,1,2018-07
7,9822589,32935097,2018-07-29 18:18:00,Rice,Rice,supermarket,66500.0,0,1,2018-07
...,...,...,...,...,...,...,...,...,...,...
11996,5760491,17555486,2017-12-15 21:06:00,Rice,Rice,supermarket,128000.0,0,1,2017-12
11997,5598782,16999147,2017-12-02 14:12:00,Rice,Rice,minimarket,64000.0,0,1,2017-12
11998,5735850,17434503,2017-12-13 19:17:00,Rice,Rice,supermarket,59990.0,3000,1,2017-12
11999,5678748,17317935,2017-12-08 22:04:00,Rice,Rice,minimarket,59500.0,3000,1,2017-12
12000,5702411,17341559,2017-12-10 17:04:00,Rice,Rice,minimarket,59500.0,3000,1,2017-12

**_Soal 9b:_** Menghapus baris ke 1 sampai ke 6

In [42]:
#disini berlaku start inclusive dan end exclusive

rice.drop(rice.index[range(0,6)])

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
7,9822589,32935097,2018-07-29 18:18:00,Rice,Rice,supermarket,66500.0,0,1,2018-07
8,9706953,32593606,2018-07-25 12:48:00,Rice,Rice,minimarket,62500.0,0,1,2018-07
9,9699516,32573843,2018-07-26 16:41:00,Rice,Rice,minimarket,62500.0,0,1,2018-07
10,9444092,31913062,2018-07-14 21:17:00,Rice,Rice,supermarket,64000.0,0,3,2018-07
11,9198777,31125365,2018-07-02 15:39:00,Rice,Rice,minimarket,112500.0,0,1,2018-07
...,...,...,...,...,...,...,...,...,...,...
11996,5760491,17555486,2017-12-15 21:06:00,Rice,Rice,supermarket,128000.0,0,1,2017-12
11997,5598782,16999147,2017-12-02 14:12:00,Rice,Rice,minimarket,64000.0,0,1,2017-12
11998,5735850,17434503,2017-12-13 19:17:00,Rice,Rice,supermarket,59990.0,3000,1,2017-12
11999,5678748,17317935,2017-12-08 22:04:00,Rice,Rice,minimarket,59500.0,3000,1,2017-12
12000,5702411,17341559,2017-12-10 17:04:00,Rice,Rice,minimarket,59500.0,3000,1,2017-12

**_Soal 10:_** Hapus kolom `receipt_id` dan `receipts_item_id`!

In [47]:
#code here cara 1 dan 2 merefer ke output yang sama
rice.drop(columns=['receipt_id','receipts_item_id'])
rice.drop(['receipt_id','receipts_item_id'], axis=1)

,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,2018-07-22 21:19:00,Rice,Rice,supermarket,128000.0,0,1,2018-07
2,2018-07-15 16:17:00,Rice,Rice,minimarket,102750.0,0,1,2018-07
3,2018-07-15 12:12:00,Rice,Rice,supermarket,64000.0,0,3,2018-07
4,2018-07-24 08:27:00,Rice,Rice,minimarket,65000.0,0,1,2018-07
5,2018-07-26 11:28:00,Rice,Rice,supermarket,124500.0,0,1,2018-07
...,...,...,...,...,...,...,...,...
11996,2017-12-15 21:06:00,Rice,Rice,supermarket,128000.0,0,1,2017-12
11997,2017-12-02 14:12:00,Rice,Rice,minimarket,64000.0,0,1,2017-12
11998,2017-12-13 19:17:00,Rice,Rice,supermarket,59990.0,3000,1,2017-12
11999,2017-12-08 22:04:00,Rice,Rice,minimarket,59500.0,3000,1,2017-12
12000,2017-12-10 17:04:00,Rice,Rice,minimarket,59500.0,3000,1,2017-12

In [51]:
rice.drop(rice.columns[range(1,6)], axis=1)

      receipt_id  unit_price  discount  quantity yearmonth
1        9622257    128000.0         0         1   2018-07
2        9446359    102750.0         0         1   2018-07
3        9470290     64000.0         0         3   2018-07
4        9643416     65000.0         0         1   2018-07
5        9692093    124500.0         0         1   2018-07
...          ...         ...       ...       ...       ...
11996    5760491    128000.0         0         1   2017-12
11997    5598782     64000.0         0         1   2017-12
11998    5735850     59990.0      3000         1   2017-12
11999    5678748     59500.0      3000         1   2017-12
12000    5702411     59500.0      3000         1   2017-12

[12000 rows x 5 columns]

**_Soal 11:_** Hapus baris ke 2 dan kolom `sub_category`!

In [52]:
#code here
#Cara 1 Mas Bayu
rice.drop(index=2, columns='sub_category')

,receipt_id,receipts_item_id,purchase_time,category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,2018-07-22 21:19:00,Rice,supermarket,128000.0,0,1,2018-07
3,9470290,31930241,2018-07-15 12:12:00,Rice,supermarket,64000.0,0,3,2018-07
4,9643416,32418582,2018-07-24 08:27:00,Rice,minimarket,65000.0,0,1,2018-07
5,9692093,32561236,2018-07-26 11:28:00,Rice,supermarket,124500.0,0,1,2018-07
6,9504155,32030785,2018-07-17 18:05:00,Rice,minimarket,63500.0,0,1,2018-07
...,...,...,...,...,...,...,...,...,...
11996,5760491,17555486,2017-12-15 21:06:00,Rice,supermarket,128000.0,0,1,2017-12
11997,5598782,16999147,2017-12-02 14:12:00,Rice,minimarket,64000.0,0,1,2017-12
11998,5735850,17434503,2017-12-13 19:17:00,Rice,supermarket,59990.0,3000,1,2017-12
11999,5678748,17317935,2017-12-08 22:04:00,Rice,minimarket,59500.0,3000,1,2017-12
12000,5702411,17341559,2017-12-10 17:04:00,Rice,minimarket,59500.0,3000,1,2017-12

In [53]:
#Cara 2 dengan menggunakan chaining code
rice.drop(2).drop('sub_category', axis=1)

,receipt_id,receipts_item_id,purchase_time,category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,2018-07-22 21:19:00,Rice,supermarket,128000.0,0,1,2018-07
3,9470290,31930241,2018-07-15 12:12:00,Rice,supermarket,64000.0,0,3,2018-07
4,9643416,32418582,2018-07-24 08:27:00,Rice,minimarket,65000.0,0,1,2018-07
5,9692093,32561236,2018-07-26 11:28:00,Rice,supermarket,124500.0,0,1,2018-07
6,9504155,32030785,2018-07-17 18:05:00,Rice,minimarket,63500.0,0,1,2018-07
...,...,...,...,...,...,...,...,...,...
11996,5760491,17555486,2017-12-15 21:06:00,Rice,supermarket,128000.0,0,1,2017-12
11997,5598782,16999147,2017-12-02 14:12:00,Rice,minimarket,64000.0,0,1,2017-12
11998,5735850,17434503,2017-12-13 19:17:00,Rice,supermarket,59990.0,3000,1,2017-12
11999,5678748,17317935,2017-12-08 22:04:00,Rice,minimarket,59500.0,3000,1,2017-12
12000,5702411,17341559,2017-12-10 17:04:00,Rice,minimarket,59500.0,3000,1,2017-12

**NOTE:** Method `drop()` tidak mengubah objek dataframenya. Apabila ingin mengubah objek semulanya:
- Melakukan assignment kembali dengan nama objek yang sama: `rice = rice.drop(...)`, atau
- Menambahkan parameter inplace: `rice.drop(..., inplace=True)`

In [55]:
#code here
#Malakukan assignment
rice = rice.drop(1)

In [60]:
rice.head(2)

,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
2,31885876,2018-07-15 16:17:00,Rice,Rice,minimarket,102750.0,0,1,2018-07
3,31930241,2018-07-15 12:12:00,Rice,Rice,supermarket,64000.0,0,3,2018-07

In [57]:
#Menambahkan parameter inplace=True
rice.drop('receipt_id', axis=1, inplace=True)

In [61]:
rice.head(2)

,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
2,31885876,2018-07-15 16:17:00,Rice,Rice,minimarket,102750.0,0,1,2018-07
3,31930241,2018-07-15 12:12:00,Rice,Rice,supermarket,64000.0,0,3,2018-07

### Slicing: **`[]` operator**

Digunakan untuk melakukan subsetting dengan cara mengiris (slicing) index pada dataframe. Formula penulisannya adalah `[start:end]` dengan mengikuti aturan indexing pada python (dimulai dari 0) dimana `start` inclusive dan `end` exclusive.

**_Soal 12:_** Dengan menggunakan metode slicing, silahkan tampilkan baris ke 1 dan ke 2

* baris ke 1 memiliki urutan index 0
* baris ke 2 memiliki urutan index 1

ambil baris x sampai y

rice[x-1:y]

Formula:

df[start:end]

**end = n-1**

In [62]:
rice = pd.read_csv('data_input/rice.csv', index_col=0)

In [63]:
rice.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07

In [65]:
#code here
rice[0:2]

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07

**_Soal 13:_** Dengan menggunakan metode slicing, silahkan tampilkan baris ke 10 sampai ke 15

In [66]:
#code here
# mbak ani
rice[9:15]

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
10,9444092,31913062,7/14/2018 21:17,Rice,Rice,supermarket,64000.0,0,3,2018-07
11,9198777,31125365,7/2/2018 15:39,Rice,Rice,minimarket,112500.0,0,1,2018-07
12,9763483,32856560,7/31/2018 5:51,Rice,Rice,hypermarket,77750.0,0,1,2018-07
13,9691090,32552145,7/26/2018 11:43,Rice,Rice,minimarket,66500.0,0,1,2018-07
14,9624752,32369065,7/23/2018 14:22,Rice,Rice,minimarket,62900.0,0,1,2018-07
15,9543709,32142234,7/19/2018 18:05,Rice,Rice,minimarket,64000.0,0,1,2018-07

**_Soal 14:_** Dengan menggunakan metode slicing, silahkan tampilkan baris ke 17 sampai ke 21

In [67]:
#code here
# mas brian
rice[16:21]

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
17,9481937,31964491,7/15/2018 19:10,Rice,Rice,supermarket,64000.0,0,1,2018-07
18,9818583,33018018,7/31/2018 15:34,Rice,Rice,minimarket,12400.0,0,10,2018-07
19,9362870,31602268,7/11/2018 17:16,Rice,Rice,minimarket,63500.0,0,1,2018-07
20,9343021,31535600,7/10/2018 7:29,Rice,Rice,minimarket,63500.0,0,1,2018-07
21,9627536,32372067,7/22/2018 20:04,Rice,Rice,minimarket,62900.0,0,1,2018-07

**_Soal 15:_** Dengan menggunakan metode slicing, silahkan tampilkan baris ke 30 sampai ke 40

In [69]:
#code here
# mas dicky
rice[29:40]

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
30,9197319,31118551,7/3/2018 21:42,Rice,Rice,supermarket,58800.0,0,1,2018-07
31,9814188,32881622,7/30/2018 8:00,Rice,Rice,minimarket,63500.0,0,1,2018-07
32,9712368,32609713,7/26/2018 19:12,Rice,Rice,minimarket,64000.0,0,1,2018-07
33,9521441,32079228,7/18/2018 20:17,Rice,Rice,minimarket,63500.0,0,1,2018-07
34,9169262,31018749,7/2/2018 18:08,Rice,Rice,minimarket,64000.0,0,3,2018-07
35,9170542,31710417,7/2/2018 14:55,Rice,Rice,minimarket,73000.0,0,1,2018-07
36,9855619,33008748,7/30/2018 21:13,Rice,Rice,minimarket,62500.0,0,1,2018-07
37,9503384,32027744,7/15/2018 14:31,Rice,Rice,minimarket,62500.0,0,1,2018-07
38,9370805,31663967,7/12/2018 23:12,Rice,Rice,supermarket,64000.0,0,1,2018-07
39,9732910,32670696,7/27/2018 12:32,Rice,Rice,supermarket,21000.0,0,1,2018-07
40,9402736,31733782,7/13/2018 13:55,Rice,Rice,minimarket,62900.0,0,2,2018-07

**_Soal 16:_** Dengan menggunakan metode slicing, silahkan tampilkan baris ke 50 dan ke 51

In [70]:
#code here
# mas fajar
rice[49:51]

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
50,9537181,32122833,7/18/2018 21:10,Rice,Rice,minimarket,63500.0,0,1,2018-07
51,9363769,31605258,7/11/2018 18:58,Rice,Rice,minimarket,63500.0,0,1,2018-07

**_Soal 17:_** Dengan menggunakan metode slicing, silahkan tampilkan baris ke 64 sampai ke 71

In [71]:
#code here
# pak rahman
rice[63:71]

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
64,9213199,31153609,7/4/2018 17:56,Rice,Rice,minimarket,63500.0,0,1,2018-07
65,9537873,32127455,7/19/2018 15:33,Rice,Rice,supermarket,64000.0,0,1,2018-07
66,9477926,31958417,7/16/2018 20:22,Rice,Rice,minimarket,203000.0,0,1,2018-07
67,9231182,31211909,7/3/2018 19:26,Rice,Rice,minimarket,63500.0,0,1,2018-07
68,9515471,32064991,7/18/2018 14:28,Rice,Rice,minimarket,53500.0,0,1,2018-07
69,9654245,32448714,7/24/2018 16:44,Rice,Rice,minimarket,63500.0,0,1,2018-07
70,9445585,31952944,7/15/2018 12:27,Rice,Rice,hypermarket,60900.0,0,2,2018-07
71,9569573,32215657,7/20/2018 13:15,Rice,Rice,minimarket,11250.0,0,2,2018-07

### Knowledge Check: Slicing

Dengan memperhatikan `end` exclusive pada metode indexing, tampilkan baris ke 8 sampai ke 12 pada data rice. Pilih jawaban yang tepat dibawah ini!

- [x] `rice[7:12]`
- [ ] `rice[8:12]`
- [ ] `rice[7:13]`
- [ ] `rice[8:13]`

In [72]:
#code here
# pak janu
rice[7:12]

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
8,9706953,32593606,7/25/2018 12:48,Rice,Rice,minimarket,62500.0,0,1,2018-07
9,9699516,32573843,7/26/2018 16:41,Rice,Rice,minimarket,62500.0,0,1,2018-07
10,9444092,31913062,7/14/2018 21:17,Rice,Rice,supermarket,64000.0,0,3,2018-07
11,9198777,31125365,7/2/2018 15:39,Rice,Rice,minimarket,112500.0,0,1,2018-07
12,9763483,32856560,7/31/2018 5:51,Rice,Rice,hypermarket,77750.0,0,1,2018-07

### `.loc` dan `.iloc`

Dengan menggunakan `.loc` dan `iloc` kita dapat melakukan pengirisan pada index **baris dan kolom**. 

Perbedaan yang mendasar dari kedua operator ini adalah:
- `.iloc` merujuk pada lokasi **index** baris atau kolomnya sehingga harus **integer**, sedangkan
- `.loc` merujuk pada lokasi **nama** baris atau kolomnya

**Mari berfokus pada .iloc terlebih dahulu**

> Syntax: `df.iloc[baris, kolom]`

Contoh: Kita ingin memilih baris pertama sampai kelima pada dataframe `rice`

In [73]:
#code here
#Menggunakan method .head() 
rice.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07

In [74]:
#Menggunakan slicing
rice[0:5]

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07

In [76]:
#Menggunakan perintah .iloc

# rice.iloc[0:5,:]
rice.iloc[0:5]

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07

**_Soal 18:_** Tampilkan baris dengan index 1 dan kolom dengan index 2, artinya adalah data pada baris kedua dan kolom `purchase_time`.

In [80]:
#code here
rice.iloc[1,2] # output Series
rice.iloc[[1],[2]] # output Dataframe

     purchase_time
2  7/15/2018 16:17

**_Soal 19:_** Mengambil baris ke 2 sampai 5 dan kolom dengan `receipt_id` sampai `purchase_time`

In [83]:
rice.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07

In [84]:
#code here
# Mbak Ani
rice.iloc[1:5,0:3]

   receipt_id  receipts_item_id    purchase_time
2     9446359          31885876  7/15/2018 16:17
3     9470290          31930241  7/15/2018 12:12
4     9643416          32418582   7/24/2018 8:27
5     9692093          32561236  7/26/2018 11:28

**_Soal 19b:_** Menampilkan baris ke 1 dalam bentuk DataFrame

In [88]:
#mbak rinni
rice.iloc[[0]]

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07

**_Soal 20:_** Menampilkan baris ke 10 dan 15

In [90]:
#code here
# Mas tavo
rice.iloc[9:15]

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
10,9444092,31913062,7/14/2018 21:17,Rice,Rice,supermarket,64000.0,0,3,2018-07
11,9198777,31125365,7/2/2018 15:39,Rice,Rice,minimarket,112500.0,0,1,2018-07
12,9763483,32856560,7/31/2018 5:51,Rice,Rice,hypermarket,77750.0,0,1,2018-07
13,9691090,32552145,7/26/2018 11:43,Rice,Rice,minimarket,66500.0,0,1,2018-07
14,9624752,32369065,7/23/2018 14:22,Rice,Rice,minimarket,62900.0,0,1,2018-07
15,9543709,32142234,7/19/2018 18:05,Rice,Rice,minimarket,64000.0,0,1,2018-07

**_Soal 21:_** Menampilkan semua data pada kolom `sub_category` dan `yearmonth` saja

In [92]:
#code here
# mas Stefanus
# rice.iloc[:,4:]

rice.iloc[:,[4, 9]]

      sub_category yearmonth
1             Rice   2018-07
2             Rice   2018-07
3             Rice   2018-07
4             Rice   2018-07
5             Rice   2018-07
...            ...       ...
11996         Rice   2017-12
11997         Rice   2017-12
11998         Rice   2017-12
11999         Rice   2017-12
12000         Rice   2017-12

[12000 rows x 2 columns]

**Note :** parameter colon (:) digunakan untuk menampilkan semua data baik pada baris ataupun kolom

In [98]:
rice.iloc[:,:] 
# colon (:) ke 1 untuk mengambil semua baris
# colon (:) ke 2 untuk mengambil semua kolom

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,yearmonth
1,9622257,32369294,2018-07-22 21:19:00,Rice,Rice,supermarket,128000.000,2018-07
2,9446359,31885876,2018-07-15 16:17:00,Rice,Rice,minimarket,102750.000,2018-07
3,9470290,31930241,2018-07-15 12:12:00,Rice,Rice,supermarket,64000.000,2018-07
4,9643416,32418582,2018-07-24 08:27:00,Rice,Rice,minimarket,65000.000,2018-07
5,9692093,32561236,2018-07-26 11:28:00,Rice,Rice,supermarket,124500.000,2018-07
...,...,...,...,...,...,...,...,...
11996,5760491,17555486,2017-12-15 21:06:00,Rice,Rice,supermarket,128000.000,2017-12
11997,5598782,16999147,2017-12-02 14:12:00,Rice,Rice,minimarket,64000.000,2017-12
11998,5735850,17434503,2017-12-13 19:17:00,Rice,Rice,supermarket,59990.000,2017-12
11999,5678748,17317935,2017-12-08 22:04:00,Rice,Rice,minimarket,59500.000,2017-12
12000,5702411,17341559,2017-12-10 17:04:00,Rice,Rice,minimarket,59500.000,2017-12

**_Soal 22:_** Menampilkan baris ke 20 dan 30, dengan kolom `category` dan `format` saja

In [93]:
rice.head()

,receipt_id,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
1,9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
2,9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
3,9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
4,9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
5,9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07

In [95]:
#code here
rice.iloc[[19,29],[3,5]]

   category       format
20     Rice   minimarket
30     Rice  supermarket

**_Soal 23:_** Menampilkan data pada baris ke 14 dengan kolom `receipt_id` sampai `sub_category`

In [97]:
#code here
rice.iloc[[13],0:5]

    receipt_id  receipts_item_id    purchase_time category sub_category
14     9624752          32369065  7/23/2018 14:22     Rice         Rice

In [98]:
rice['sub_category'].unique()

array(['Rice'], dtype=object)

#### Extra Challenge
Lakukan subsetting untuk menampilkan **2 baris terbawah** dan **4 kolom pertama**.

Gunakan beberapa metode subsetting dibawah ini :
1. Menggunakan `.iloc[ , ]`
2. Menggunakan method `tail(2)` untuk mendapatkan 2 baris terbawah, kemudian lakukan chaining dengan `.iloc`
3. Gunakan `.iloc` kemudian tambahkan `(rice.shape[0]-2):` didalamnya, untuk mendapatkan 2 baris terakhir.

In [44]:
#code here

**Mari kita pergi ke .loc**

> Syntax: `df.loc[baris, kolom]`

Menggunakan `.loc`, kita bisa mengambil baris dan kolom berdasarkan namanya. Contoh kita ingin mengambil baris dengan `receipt_id` 9643416 dan 9706953, serta mengambil semua kolom.

In [99]:
rice = pd.read_csv("data_input/rice.csv", index_col=1)
rice = rice.drop('Unnamed: 0', axis=1)
rice.head(8)

,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
receipt_id,,,,,,,,,
9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07
9504155,32030785,7/17/2018 18:05,Rice,Rice,minimarket,63500.0,0,1,2018-07
9822589,32935097,7/29/2018 18:18,Rice,Rice,supermarket,66500.0,0,1,2018-07
9706953,32593606,7/25/2018 12:48,Rice,Rice,minimarket,62500.0,0,1,2018-07

In [100]:
#code here
rice.loc[[9643416,9706953]]

,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
receipt_id,,,,,,,,,
9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
9706953,32593606,7/25/2018 12:48,Rice,Rice,minimarket,62500.0,0,1,2018-07

**_Soal 24:_** Mengambil baris dengan `receipt_id` 9643416 dan 9706953 dari kolom `category` sampai `quantity`

In [101]:
#code here
rice.loc[[9643416,9706953], 'category':'quantity'] # .loc[]

           category sub_category      format  unit_price  discount  quantity
receipt_id
9643416        Rice         Rice  minimarket     65000.0         0         1
9706953        Rice         Rice  minimarket     62500.0         0         1

In [104]:
rice.iloc[[3,7], 2:8]  # no 24 yang menggunakan .iloc[]

           category sub_category      format  unit_price  discount  quantity
receipt_id
9643416        Rice         Rice  minimarket     65000.0         0         1
9706953        Rice         Rice  minimarket     62500.0         0         1

**_Soal 25a:_** Mengambil baris dari `receipt_id` 9622257 sampai 9504155

In [115]:
rice.loc[9622257]

,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
receipt_id,,,,,,,,,
9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
9622257,32369293,7/22/2018 21:19,Rice,Rice,supermarket,159900.0,0,1,2018-07

In [116]:
#code here
# rice.loc[9622257:9504155] #code ini akan menghasilkan error karen id 9622257 tidak unique

**Note:** Akan menghasilkan error dikarenakan `receipt_id` 9622257 memiliki 2 nilai

**_Soal 25b:_** Mengambil baris dari `receipt_id` 9643416 sampai 9504155

In [109]:
#code here
# Mbak Ani
rice.loc[9643416:9504155]

,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
receipt_id,,,,,,,,,
9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07
9504155,32030785,7/17/2018 18:05,Rice,Rice,minimarket,63500.0,0,1,2018-07

**_Soal 26:_** Tampilkan nilai `unit_price` untuk `receipt_id` 9622257

In [119]:
# code here
rice.loc[[9622257], ['unit_price']]

            unit_price
receipt_id
9622257       128000.0
9622257       159900.0

#### Dive Deeper:
Baca data `companies.csv`dan gunakan `index_col=1`, kemudian tampilkan beberapa baris menggunakan method `head()` atau `tail()`

Dengan menggunakan metode indexing, jawab pertanyaan dibawah ini!

1. Tampilkan lokasi kantor *Li and Partners*?
2. Tampilkan nilai `Returns` yang dihasilkan oleh PT. Algoritma Data Indonesia?
3. Tampilkan nilai `Forecasted Growth` untuk Palembang Konsultansi?

In [118]:
#code here
companies = pd.read_csv('data_input/companies.csv')
companies

,ID,Customer Name,Consulting Sales,Software Sales,Forecasted Growth,Returns,Month,Day,Year,Location,Account
0,30940,New Media Group,IDR7125000,IDR5500000,30.00%,"IDR1,500,000",1,10,2017,Jakarta,Enterprise
1,82391,Li and Partners,IDR420000,IDR820000,10.00%,"IDR400,000",6,15,2016,Jakarta,Startup
2,18374,PT. Kreasi Metrik Solusi,0,IDR550403,25.00%,0,3,29,2012,Surabaya,Enterprise
3,57531,PT. Algoritma Data Indonesia,IDR850000,IDR395500,4.00%,0,7,17,2017,Jakarta,Startup
4,19002,Palembang Konsultansi,IDR2115000,0,-15.00%,0,2,24,2018,Bandung,Startup
5,31142,PT. Surya Citra Manajemen,IDR960000,IDR503000,19.00%,0,1,19,2019,Jakarta,Enterprise

========================================= END OF DAY 3==========================================================

### Conditional Subsetting

Selain menggunakan `.loc` dan `.iloc`, kita dapat melakukan subsetting berdasarkan kondisi tertentu. Misal pada dataframe `rice`, kita ingin mengambil beberapa data dengan kondisi sebagai berikut:

- Transaksi yang terjadi di supermarket: `.format == 'supermarket'`
- Transaksi dengan produk yang harganya lebih dari sama dengan 200000: `.unit_price >= 200000`
- Transaksi dimana kuantitas tidak sama dengan 0: `.quantity != 0`

Syntax penulisan untuk conditional subsetting adalah:

**`df[df['column_name'] <comparison_operator> <value>]`**

atau

**`df[df.column_name <comparison_operator> <value>]`**

Contoh comparison_operator adalah seperti `==`, `!=`, `>`, `>=`, `<`, `<=`.

**_Soal 27:_** Tampilkan data yang memiliki `format` Supermarket!

In [ ]:
#code here

**_Soal 28:_** Tampilkan data yang memiliki `unit_price` lebih besar sama dengan 200000

In [ ]:
#code here

**_Soal 29:_** Tampilkan data yang memiliki `unit_price` kurang dari 100000

In [ ]:
#code here

**_Soal 30:_** Tampilkan data yang memiliki `format` selain Supermarket!

In [ ]:
#code here

**Additional Information:**

Kita juga dapat menggunakan operator `&` (AND) dan `|` (OR) untuk melakukan subsetting lebih dari 1 kondisi. Misalnya kita ingin melihat data penjualan dari seorang pegawai bernama Moana yang jumlahnya lebih dari 5000, maka kita dapat menggunakan syntax:
```
sales[(sales.salesperson == 'Moana') & (sales.amount > 5000)]
```

Untuk subsetting dengan kondisi lebih dari 1, setiap kondisi diletakkan **di dalam tanda kurung `()`** atau bisa ditulis dengan syntax berikut:

```
df[(kondisi pertama) operator (kondisi kedua) operator (kondisi ketiga) dan seterusnya...]
```

**Poin:**
- Operator AND: harus semua kondisi terpenuhi dalam satu baris agar muncul
- Operator OR: salah satu kondisi saja sudah terpenuhi maka baris tsb muncul

**Contoh sederhana penggunaan OR dan AND**

In [133]:
df = pd.DataFrame({
    'angka': [1,2,3],
    'huruf': ['a','b','c']
})
df

   angka huruf
0      1     a
1      2     b
2      3     c

**OPERATOR AND**

Menampilkan baris dengan `angka` 1 dan `huruf` a

In [ ]:
#code here

Menampilkan baris dengan `angka` 1 dan `huruf` b

In [ ]:
#code here

**OPERATOR OR**

Menampilkan baris dengan `angka` 1 atau `huruf` b

In [ ]:
#code here

**_Soal 31:_** Lakukan subsetting untuk mengambil semua transaksi di supermarket yang `unit_price`nya di atas 200000.

In [ ]:
#code here

**_Soal 32:_** Tampilkan pembelian barang di supermarket dan pembeliannya kurang dari 5 barang(units)

In [ ]:
#code here

**_Soal 33:_** Subset baris yang `format`nya supermarket dan minimarket

In [ ]:
#code here

### Dive Deeper

Dengan menggunakan metode conditional subsetting, jawab pertanyaan dibawah ini:

1. Berapa jumlah transaksi yang terjadi pada pembelian **minimal 8 units** (mengacu pada kolom `quantity`)?
2. Berapa jumlah transaksi yang terjadi di **minimarket**?
3. Berapa jumlah transaksi yang terjadi di **hypermarket** dan memiliki pembelian **minimal 10 units** (mengacu pada kolom `quantity`)?

In [ ]:
#code here

In [ ]:
#code here

In [ ]:
#code here

**Bonus Challenge**

Berapa banyak transaksi pada dataframe `rice` yang terjadi pada bulan Juli tahun 2018 baik di `minimarket` maupun `supermarket`?

In [70]:
# code here

# Referencing and Copying

Pada python, tanda sama dengan (`=`) bisa digunakan untuk me-**refer** sebuah Dataframe. Sekarang mari kita lihat kembali dataframe `rice`:

In [56]:
rice = pd.read_csv("data_input/rice.csv", index_col=1)
rice = rice.drop('Unnamed: 0', axis=1)
rice.head()

,receipts_item_id,purchase_time,category,sub_category,format,unit_price,discount,quantity,yearmonth
receipt_id,,,,,,,,,
9622257,32369294,7/22/2018 21:19,Rice,Rice,supermarket,128000.0,0,1,2018-07
9446359,31885876,7/15/2018 16:17,Rice,Rice,minimarket,102750.0,0,1,2018-07
9470290,31930241,7/15/2018 12:12,Rice,Rice,supermarket,64000.0,0,3,2018-07
9643416,32418582,7/24/2018 8:27,Rice,Rice,minimarket,65000.0,0,1,2018-07
9692093,32561236,7/26/2018 11:28,Rice,Rice,supermarket,124500.0,0,1,2018-07

**Reference**

Membuat dataframe baru dengan nama `rice_second` yang menyimpan semua transaksi seperti `rice`. Kemudian misalnya kita ingin update kolom `discount` agar menjadi 15 pada semua barisnya.

In [ ]:
#code here

Cek dataframe `rice`

In [ ]:
#code here

**Copy**

Membuat dataframe baru dengan nama `rice_second` yang menyimpan semua transaksi seperti `rice`. Kemudian misalnya kita ingin update kolom `discount` agar menjadi 15 pada semua barisnya.

In [ ]:
#code here

Cek dataframe `rice`

In [ ]:
#code here